; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_10_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 - counter
	)
  (:init
		(= (value c0) 100)
	(= (value c1) 97)
	(= (value c2) 44)
	(= (value c3) 23)
	(= (value c4) 75)
	(= (value c5) 5)
	(= (value c6) 55)
	(= (value c7) 73)
	(= (value c8) 6)
	(= (value c9) 98)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 9
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 9
3. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 4 of 9
4. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 9
5. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 4 of 9
6. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 9
7. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 9
8. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 9
9. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 4 of 9
10. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 4 of 9
11. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 9
12. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 9
13. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 4 of 9
14. (increment c3)
   changed: (value c3) from 23 to 27
   goals met: 4 of 9
15. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 4 of 9
16. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 4 of 9
17. (increment c3)
   changed: (value c3) from 27 to 31
   goals met: 4 of 9
18. (increment c3)
   changed: (value c3) from 31 to 35
   goals met: 4 of 9
19. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 4 of 9
20. (increment c2)
   changed: (value c2) from 44 to 51
   goals met: 4 of 9
21. (increment c2)
   changed: (value c2) from 51 to 58
   goals met: 4 of 9
22. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 4 of 9
23. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 4 of 9
24. (decrement c0)
   changed: (value c0) from 100 to 98
   goals met: 4 of 9
25. (decrement c0)
   changed: (value c0) from 98 to 96
   goals met: 5 of 9
26. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 5 of 9
27. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 5 of 9
28. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 5 of 9
29. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 5 of 9
30. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 5 of 9
31. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 5 of 9
32. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 5 of 9
33. (increment c8)
   changed: (value c8) from 6 to 13
   goals met: 5 of 9
34. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 5 of 9
35. (increment c8)
   changed: (value c8) from 13 to 21
   goals met: 5 of 9
36. (increment c8)
   changed: (value c8) from 21 to 29
   goals met: 5 of 9
37. (increment c8)
   changed: (value c8) from 29 to 37
   goals met: 5 of 9
38. (increment c8)
   changed: (value c8) from 37 to 45
   goals met: 5 of 9
39. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 5 of 9
40. (increment c8)
   changed: (value c8) from 45 to 54
   goals met: 5 of 9
41. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 5 of 9
42. (increment c8)
   changed: (value c8) from 54 to 64
   goals met: 5 of 9
43. (increment c8)
   changed: (value c8) from 64 to 74
   goals met: 6 of 9
44. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 6 of 9
45. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 6 of 9
46. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 6 of 9
47. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 6 of 9
48. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 6 of 9
49. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 6 of 9
50. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 6 of 9
51. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 6 of 9
52. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 6 of 9
53. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 6 of 9
54. (increment c5)
   changed: (value c5) from 5 to 15
   goals met: 6 of 9
55. (increment c5)
   changed: (value c5) from 15 to 25
   goals met: 6 of 9
56. (increment c5)
   changed: (value c5) from 25 to 35
   goals met: 6 of 9
57. (increment c5)
   changed: (value c5) from 35 to 45
   goals met: 6 of 9
58. (increment c5)
   changed: (value c5) from 45 to 55
   goals met: 5 of 9
59. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 5 of 9
60. (increment c5)
   changed: (value c5) from 55 to 65
   goals met: 5 of 9
61. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 5 of 9
62. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 5 of 9
63. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 5 of 9
64. (increment c3)
   changed: (value c3) from 35 to 41
   goals met: 5 of 9
65. (increment c3)
   changed: (value c3) from 41 to 47
   goals met: 5 of 9
66. (increment c3)
   changed: (value c3) from 47 to 53
   goals met: 5 of 9
67. (increment c3)
   changed: (value c3) from 53 to 59
   goals met: 6 of 9
68. (increment c2)
   changed: (value c2) from 58 to 65
   goals met: 5 of 9
69. (increment c3)
   changed: (value c3) from 59 to 65
   goals met: 5 of 9
70. (increment c2)
   changed: (value c2) from 65 to 72
   goals met: 5 of 9
71. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 5 of 9
72. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 5 of 9
73. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 5 of 9
74. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 5 of 9
75. (increment c3)
   changed: (value c3) from 65 to 71
   goals met: 5 of 9
76. (increment c2)
   changed: (value c2) from 72 to 82
   goals met: 5 of 9
77. (increment c6)
   changed: (value c6) from 55 to 56
   goals met: 5 of 9
78. (increment c5)
   changed: (value c5) from 65 to 75
   goals met: 5 of 9
79. (increment c5)
   changed: (value c5) from 75 to 85
   goals met: 6 of 9
80. (decrement_rate c6)
   changed: (rate_value c6) from 1 to 0
   goals met: 6 of 9
81. (decrement c5)
   changed: (value c5) from 85 to 75
   goals met: 5 of 9
82. (decrement c5)
   changed: (value c5) from 75 to 65
   goals met: 5 of 9
83. (increment c3)
   changed: (value c3) from 71 to 77
   goals met: 4 of 9
84. (increment c4)
   changed: (value c4) from 75 to 76
   goals met: 4 of 9
85. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 9
86. (increment c4)
   changed: (value c4) from 76 to 78
   goals met: 5 of 9
87. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 5 of 9
88. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 5 of 9
89. (increment c2)
   changed: (value c2) from 82 to 92
   goals met: 5 of 9
90. (decrement c1)
   changed: (value c1) from 97 to 91
   goals met: 5 of 9
91. (decrement c0)
   changed: (value c0) from 96 to 94
   goals met: 5 of 9
92. (decrement c0)
   changed: (value c0) from 94 to 92
   goals met: 5 of 9
93. (decrement c0)
   changed: (value c0) from 92 to 90
   goals met: 6 of 9
94. (increment c5)
   changed: (value c5) from 65 to 75
   goals met: 6 of 9
95. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 6 of 9
96. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 6 of 9
97. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 6 of 9
98. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 6 of 9
99. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 6 of 9
100. (increment c6)
   changed: (value c6) from 56 to 61
   goals met: 6 of 9
101. (increment c6)
   changed: (value c6) from 61 to 66
   goals met: 6 of 9
102. (increment c6)
   changed: (value c6) from 66 to 71
   goals met: 6 of 9
103. (increment c6)
   changed: (value c6) from 71 to 76
   goals met: 6 of 9
104. (increment c3)
   changed: (value c3) from 77 to 83
   goals met: 5 of 9
105. (increment c3)
   changed: (value c3) from 83 to 89
   goals met: 5 of 9
106. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 5 of 9
107. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 5 of 9
108. (decrement c4)
   changed: (value c4) from 78 to 74
   goals met: 6 of 9
109. (decrement c3)
   changed: (value c3) from 89 to 81
   goals met: 6 of 9
110. (decrement c3)
   changed: (value c3) from 81 to 73
   goals met: 7 of 9
111. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 7 of 9
112. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 7 of 9
113. (increment c3)
   changed: (value c3) from 73 to 83
   goals met: 6 of 9
114. (increment c4)
   changed: (value c4) from 74 to 78
   goals met: 5 of 9
115. (increment c5)
   changed: (value c5) from 75 to 85
   goals met: 5 of 9
116. (increment c6)
   changed: (value c6) from 76 to 81
   goals met: 5 of 9
117. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 5 of 9
118. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 5 of 9
119. (increment c7)
   changed: (value c7) from 73 to 75
   goals met: 4 of 9
120. (increment c8)
   changed: (value c8) from 74 to 84
   goals met: 5 of 9
121. (increment c7)
   changed: (value c7) from 75 to 77
   goals met: 5 of 9
122. (decrement c6)
   changed: (value c6) from 81 to 76
   goals met: 6 of 9
123. (decrement c5)
   changed: (value c5) from 85 to 75
   goals met: 6 of 9
124. (decrement c4)
   changed: (value c4) from 78 to 74
   goals met: 7 of 9
125. (decrement c3)
   changed: (value c3) from 83 to 73
   goals met: 8 of 9
126. (decrement c2)
   changed: (value c2) from 92 to 82
   goals met: 7 of 9
127. (decrement c2)
   changed: (value c2) from 82 to 72
   goals met: 8 of 9
128. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 8 of 9
129. (decrement c1)
   changed: (value c1) from 91 to 84
   goals met: 7 of 9
130. (decrement c1)
   changed: (value c1) from 84 to 77
   goals met: 7 of 9
131. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 7 of 9
132. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 7 of 9
133. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 7 of 9
134. (increase_rate c0)
   changed: (rate_value c0) from 5 to 6
   goals met: 7 of 9
135. (increase_rate c0)
   changed: (rate_value c0) from 6 to 7
   goals met: 7 of 9
136. (decrement c1)
   changed: (value c1) from 77 to 70
   goals met: 8 of 9
137. (decrement c0)
   changed: (value c0) from 90 to 83
   goals met: 8 of 9
138. (decrement c0)
   changed: (value c0) from 83 to 76
   goals met: 8 of 9
139. (decrement c0)
   changed: (value c0) from 76 to 69
   goals met: 9 of 9
